[
  {
    "name": "Beach Clean Up",
    "description": "Come on over to Galveston Beach to help clean up trash with your fellow volunteers! Plastic bags will be provided for participants to fill trash with. Afterwards, we will gather together as a group and sort trash into recycling materials and trash materials.",
    "location": "Galveston Beach",
    "requiredSkills": "Organizing, Teamwork",
    "urgency": "Help Necessary",
    "date": "2024-10-14",
    "time": "15:40",
    "volunteersNeeded": "10"
  },
  {
    "name": "Kids Coal Drive",
    "description": "Calling all volunteers! Mr. Kringle needs your help this holiday season! Using the official North Pole naughty list provided by the man himself, we will be organizing coals by sizes according to childrens' mischief level. Any donated coal would be appreciated.",
    "location": "Downtown Ohio Fire Department",
    "requiredSkills": "None",
    "urgency": "Help Needed",
    "date": "2024-12-05",
    "time": "09:00",
    "volunteersNeeded": "10"
  },
  {
    "name": "Tree Planting",
    "description": "Come together this October in nurturing a better future for Mother Nature. In honor of National Rincon Day, we will be planting 3,360 trees around Rincon National Park. Great opportunity for those who love nature and helping the environment.",
    "location": "Rincon National Park",
    "requiredSkills": "Time Management",
    "urgency": "Help Would be Appreciated",
    "date": "2024-10-18",
    "time": "14:30",
    "volunteersNeeded": "30"
  },
  {
    "name": "Nursing Homes",
    "description": "While rounding up the gang loose at Arkham Asylum, the Dark Knight needs your help rounding up the elderly in the nursing homes for a good time! Help facilitate several thrilling events like bingo and charades. Includes a brief guest appearance from Justice Gang.",
    "location": "Gotham Nursing Homes",
    "requiredSkills": "Communication",
    "urgency": "Help Necessary",
    "date": "2024-11-14",
    "time": "11:00",
    "volunteersNeeded": "25"
  },
  {
    "name": "Animal Shelter",
    "description": "The staff at the IFAS are looking into toys and structures to help relieve the stress of their residents! Join them on January of next year to create wooden climbing structures. Perfect for those who like working with their hands and enjoy socializing with feral animals.",
    "location": "International Feral Animal Shelter",
    "requiredSkills": "Power Tools",
    "urgency": "Help Would be Appreciated",
    "date": "2025-01-08",
    "time": "16:30",
    "volunteersNeeded": "5"
  },
  {
    "name": "Soup Kitchen",
    "description": "The Cola-Cola Company is looking to get into the soup industry and also happens to be in a giving mood. Come volunteer for the local Missouri community in being one of the first to serve fresh hot bowls of Coca-Cola soup.",
    "location": "Missouri Coca-Cola Factory",
    "requiredSkills": "Communication, Time Management",
    "urgency": "Help Needed",
    "date": "2025-02-12",
    "time": "13:30",
    "volunteersNeeded": "4"
  },
  {
    "name": "Special Needs School",
    "description": "Come join us in the grand opening of Lebron James' special needs school. Volunteers will give tours around the campus and facilitate with delivering the end of day kindergarten curriculum.",
    "location": "Lebron James School for Special Needs",
    "requiredSkills": "Communication",
    "urgency": "Help Necessary",
    "date": "2024-10-20",
    "time": "16:30",
    "volunteersNeeded": "15"
  }
]
